# ==========================================
# ЭТАП 1: Сборка (Builder)
# ==========================================
FROM golang:1.25-alpine AS builder 
#Мы говорим Докеру: "Скачай из интернета официальный образ с установленным языком Go (версии 1.22, можешь поменять на свою). Версия alpine значит, что это супер-урезанный Linux (весит всего 5 мегабайт). И давай назовем этот этап builder".

WORKDIR /app
# Создаем папку /app внутри контейнера и делаем ее рабочей (как будто мы сделали cd /app).

COPY go.mod go.sum ./
# Копируем с твоего компьютера файлы с зависимостями внутрь контейнера (в папку /app).

RUN go mod download
# Запускаем команду скачивания всех библиотек (grpc, cleanenv, postgres драйверы). Почему мы копируем сначала только их, а не весь проект? Потому что Docker кэширует слои. Если ты поменяешь main.go, Докер не будет заново скачивать библиотеки из интернета — он возьмет их из кэша. Это ускоряет сборку в 10 раз!

COPY . .
# Только теперь копируем весь остальной код из твоего проекта (точка) внутрь контейнера (точка).

RUN CGO_ENABLED=0 GOOS=linux go build -o my-user-service ./cmd/user-service/main.go
# CGO_ENABLED=0 — отключает зависимости от библиотек C. Наш экзешник становится полностью независимым, он запустится на ЛЮБОМ Линуксе.
# GOOS=linux — заставляем компилятор собрать файл именно для Linux (полезно, если ты пишешь код на Windows/Mac).
# -o my-user-service — называем наш скомпилированный файл.
# ./cmd/user-service/main.go — путь до твоего main.go.

# ДОБАВЛЯЕМ СБОРКУ МИГРАТОРА:
RUN CGO_ENABLED=0 GOOS=linux go build -o migrator ./cmd/migrator/main.go

# ==========================================
# ЭТАП 2: Финальный образ (Runner)
# ==========================================
FROM alpine:latest
# Берем абсолютно пустой, микроскопический Linux Alpine. В нем НЕТ языка Go. Он весит 5 МБ.

WORKDIR /root/
# Заходим в домашнюю папку внутри этого нового линукса.

COPY --from=builder /app/my-user-service .
COPY --from=builder /app/migrator .
# Самая главная строка! Мы говорим: "Сходи в этап builder (где мы компилировали код), возьми оттуда готовый бинарник /app/my-user-service и положи сюда". Исходный код .go файлы нам в проде не нужны, нужен только экзешник!

# !!!!! ВАЖНО: Если ваш мигратор читает .sql файлы из папки (например, migrations/), пишем так, !!!!! -> потому что Компилятор Go при сборке бинарного файла (migrator) запекает в него только Go-код. Сами .sql файлы с таблицами остаются лежать на диске. Если не скопировать папку migrations во второй этап (Runner), мигратор запустится внутри пустого контейнера, попытается прочитать файлы .sql с диска, не найдет их и упадет с ошибкой file not found.
COPY --from=builder /app/migrations ./migrations 

EXPOSE 50051 2112
# Это документация. Мы говорим Докеру (и другим разработчикам): "Это приложение будет слушать порт 50051 для gRPC и 2112 для Прометеуса. Откройте эти порты наружу".

CMD ["./my-user-service"]
# Команда, которая выполнится при старте контейнера. Мы просто запускаем наш бинарник.
